#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-2PRonkh2vXzGcPRQ

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
aws_api_gateway_vpc_link.main: Refreshing state... [id=pduqee]
aws_api_gateway_rest_api.main: Refreshing state... [id=ebcwziuuvg]
aws_api_gateway_resource.proxy: Refreshing state... [id=ogiodu]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-ebcwziuuvg-ogiodu-ANY]
aws_eks_cluster.tech: Refreshing state... [id=tech]
aws_api_gateway_rest_api.main: Drift detected (delete)
aws_api_gateway_vpc_link.main: Drift detected (delete)
aws_eks_cluster.tech: Drift detected (delete)
aws_api_gateway_method.proxy: Drift detected (delete)
aws_api_gateway_resource.proxy: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.tech has been deleted
  - resource "aws_eks_cluster" "tech" {
      - certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJUm5EWmtpdHNkbkl3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1Ua3hOelEzTWpCYUZ3MHpOREE1TVRjeE56VXlNakJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUREekNDejg2M0g4MG1FaU0vbURTVEhKa0VxTTl4VTVTNzhqUXRqUThocDNxWk1tMndpbTNoZVFPZFIKdnltOGZMaFlWRE9UM1dzWUVwVWI0aTFraHZOZ3Q3dlYxcDAwZUVNUERSOGdFRDlBYzh4THhBM1lpZDRpaGhaMwpIWWxHRHBYMTFKYVA1ZEtBT0RqWjh4RmxKM1VLSHNXTVZRdnlsYVRTRlRHcjE2ZHZhZ0tQc1pYWFB5TTIwZWp5ClZCLzJhMDZRL3JiaFpOSjNpQjU1QVlmT2FMVU9lM2pkREZmZWh1eVJUeGxVdEEwUEJuMDJuVjFHQVVrZEd4RVoKcmxmYkcrakljRmRFYkxJTm5iVXJMSVBmZDhHMDIrWWpWeTFVTEFycStZdFVvRWpzQ2VkRlFTNndhZjVJbENVRAovVFNSdmcvWlNCUDBzWTEvZlA3OHpRNW1BZldiQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUeFhSQXlhSlpsVC9UR25IbmZoQWdNMHFPUEpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUF3SEg5dmNiWgpYMUw5V0VGTHdZSndjMkxPZlQ0eWxoZG1jcktEQ2Z3MFgrdk1FbnlDQVh6VXZjZU0vMEs2dXd3Z2xiSmJsQTN5CjRwb1d5dDF0Sk5Lek8wWllPZ3kycENlcndwUXc5ZG5wNXJMM0xVUm1QU2IvVE5Ua2RWdG1CU0F0WnVrRkJteVoKcmZZWFB3bnYyckhXSjhsRFhXNnR4UzdqOThIWmk2VUVPNm1oakVGMlFuMmdBNUhsQ3c2MmJVQ2ZSTE55RFVlOAprV2d2Y0t5RUV4UFNOalg2c0hrY0VjaHRBTUhxa3ljczhpN2ozcm9ySTZvZTR0bFdWNEVOdEl2R2lsbC9xTXljCjNCTk9yVXpjQVFNdGxOWnpXZnV0SlR0aVkxNk1JWWwrY01hYUVCOHRIc1M1ZXk0VENsdWdlQXVkOG1wOEtZaG8KUFFtOUwrc2xLeDQrCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint                  = "https://B453925D5B10C5E4DA8B23A7CC148248.gr7.us-east-1.eks.amazonaws.com" -> null
        id                        = "tech"
      - name                      = "tech" -> null
        tags                      = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::019248244455:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-07d190e14405105b0",
              + "subnet-0999539928723d781",
              + "subnet-0c6712171ff29cfd3",
              + "subnet-0e5d6405ea49d3b76",
              + "subnet-0f4ce9ecc660cd3f2",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::019248244455:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-07d190e14405105b0",
          + "subnet-0999539928723d781",
          + "subnet-0c6712171ff29cfd3",
          + "subnet-0e5d6405ea49d3b76",
          + "subnet-0f4ce9ecc660cd3f2",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*